# 代码片段1
print("----代码片段1----")
# 打开文件，用写的方式
# r表示后面字符串内容不需要转义
# f称之为文件句柄
f = open(r"test01.txt",'r')  # 为保障后续代码运行，此处将原文w更改为r！！！
# 文件打开后必须关闭
f.close()
# 此案例说明，w以写方式打开文件，会覆盖文件内容！！！默认是如果没有文件，则创建


# 代码片段2
print("----代码片段2----")
# with语句案例
with open(r"test01.txt",'r') as f:
    pass
# 下面语句块开始对文件f进行操作
# 在本模块中不需要在使用close关闭文件f

# with案例2
with open(r"test01.txt",'r') as f:
    # 按行读取内容
    strline = f.readline()
    # 此结构保证能够完整读取文件直到结束
    while strline:
        print(strline)
        strline = f.readline()

# list能用打开的文件作为参数，把文件内每一行内容作为一个元素
with open(r"test01.txt",'r') as f:
    # 以打开的文件f作为参数，创建列表
    l = list(f)
    for line in l:
        print(line)

# read是按字符读取文件内容
# 允许输入参数决定读取几个字符，如果没有指定，从当前位置读取到结尾
# 否则，从当前位置读取指定个数字符
with open(r"test01.txt",'r') as f:
    strChar = f.read()
    print(len(strChar))
    print(strChar)
with open(r"test01.txt",'r') as f:
    strChar = f.read(1)
    print(len(strChar))
    print(strChar)
# 作业：使用read读取文件，每次读取一个，使用循环读完，尽量保持格式

# 代码片段3
print("----代码片段3---")
# seek案例
# 打开文件后，从第五个字节开始读取
# 打开读写指针在0处，即文件的开头
with open(r"test01.txt",'r') as f:
    # seek移动单位是字节
    f.seek(6,0)
    strChar = f.read()
    print(strChar)
# 关于读取文件的练习，打开文件，三个字符一组读出内容，然后显示在屏幕上，每读取一次，休息一秒钟
# 让程序暂停，可以使用time下的sleep函数
import time
with open(r"test01.txt",'r') as f:
    # read参数的单位是字符，可以理解成一个汉字就是一个字符
    strChar = f.read(3)
    while strChar:
        print(strChar)
        # sleep参数单位是秒
        time.sleep(1)
        strChar = f.read(3)

# 作业：解释以下运行结果，为什么不是每行三个汉字？

# 代码片段4
print("----代码片段4----")
with open(r"test01.txt",'r') as f:
    strChar = f.read(3)
    pos = f.tell()
    while strChar:
        print(pos)
        print(strChar)
        strChar = f.read(3)
        pos = f.tell()
# 以下结果说明：tell的返回数字的单位是byte，而read是以字符为单位的。

# 代码片段5
print("----代码片段5----")
# write案例
# 1、向文件追加一句诗
# a代表追加方式打开
with open(r"test01.txt",'a') as f:
    f.write("\n《诫子书》\n诸葛亮")
# 可以直接写入行，用writelines
# writelines表示写入很多行，参数可以是list格式
with open(r"test01.txt",'a') as f:
    # 注意字符串内含有换行符
    f.writelines("\n夫君子之行，静以修身，俭以养德。非淡泊无以明志，非宁静无以致远。夫学须静也，才须学也，非学无以广才，非志无以成学。淫慢则不能励精，险躁则不能冶性。年与时驰，意与日去，遂成枯落，多不接世，悲守穷庐，将复何及。")

l = ['\n《治家格言》','\n朱用纯','\n黎明即起，洒扫庭除，要内外整洁，既昏便息，关锁门户，必亲自检点。','一粥一饭，当思来之不易；半丝半缕，恒念物力维艰。','宜未雨而稠缪，毋临渴而掘井。','自奉必须俭约，宴客切勿流连。','器具质而洁，瓦窑胜金玉；饮食约而精，园蔬逾珍馐。','勿营华屋，勿谋良田。','三姑六婆，实淫盗之媒；婢美妾娇，非闺房之福。','奴仆勿用俊美，妻妾切忌艳妆。','宗祖虽远，祭祀不可不诚；子孙虽愚，经书不可不读。','居身务期质朴，教子要有义方。','勿贪意外之财，勿饮过量之酒。','与肩挑贸易，毋占便宜；见贫苦亲邻，须加温恤。','刻薄成家，理无久享；伦常乖舛，立见消亡。','兄弟叔侄，须分多润寡；长幼内外，宜法肃辞严。','听妇言，乖骨肉，岂是丈夫；重资财，薄父母，不成人子。','嫁女择佳婿，毋索重聘；娶媳求淑女，勿计厚奁','见富贵而生谄容者，最可耻；遇贫穷而作骄态者，贱莫甚。','居家诫争讼，讼则终凶；处世戒多言，言多必失。','勿恃势力而凌逼孤寡；勿贪口腹而恣杀牲擒','乖僻自是，悔悟必多；颓惰自甘，家道难成。','狎昵恶少，久必受其累；屈志老成，急则可相依。','轻听发言，安知非人之谮愬，当忍耐三思；因事相争，焉知非我之不是，须平心再想。','施惠无念，受恩莫忘。','凡事当留余地，得意不宜再往。','人有喜庆，不可生妒忌心；人有祸患，不可生喜辛心。','善欲人见，不是真善；恶恐人知，便是大恶。','见色而起淫心，抱在妻女；匿怨而用暗箭，祸延子孙。','家门和顺，虽饔飧不济，亦有余欢；国课早完，即囊橐无余，自得至乐。','读书志在圣贤，非徒木科第；为官心存君国，岂计身家。','守分安命，顺时听天。为人若此，庶乎近焉。']
with open(r"test01.txt",'a') as f:
    f.writelines(l)